{
    "samschindler.com":
    {
        "accomplishments": "Created a homepage for Sam Schindler, a teacher and activist based in Lancaster, PA. He now uses this site to host his podcast, \"What We Will Abide.\" He also uses the site to distribute information about his tutoring, his work for the TBA School of Lancaster, and his CV.",
        "notes":
        [
            "An initial version of the site was created from scratch using Bootstrap before switching to the WordPress setup that is active now.",
            "Using WordPress' built-in RSS technology, Mr. Schindler publishes his podcast to iTunes, as well as his personal website.",
            "Since getting the site up and running, I haven't had to intervene. Mr. Schindler handles everything on there himself."
        ]
    },
    "corerp.co":
    {
        "accomplishments": "Currently on hiatus as I attend college, CoreRP (formerly MonkeyStrikeGaming) was my fledgling gaming community. Originally created for my friends in high school, CoreRP grew to about 100 members between 2012 and 2014. I used CoreRP as a tool for teaching myself full-stack DevOps, as everything was hosted on a dedicated server I purchased from OVH. Over my past several years administrating the server, I've learned many things about security, deploying webservers, configuring microservices, and, most recently, using Docker to containerize game servers.",
        "notes":
        [
            "Over the server's lifespan, we've never had a security incident thanks to key-based authentication and code auditing.",
            "Hosting game servers taught me a lot about debugging binaries, using Docker for containerization, shell scripting, and troubleshooting configuration files.",
            "At CoreRP's peak, we had servers for Minecraft, Garry's Mod, Insurgency, and Team Fortress 2.",
            "I still host game servers on the CoreRP server for my friend Otterfiend and his group <a href=\"https://steamcommunity.com/groups/ClassicBonanza\">Classic Bonanza</a>."
        ]
    },
    "Manheim Township CoderDojo":
    {
        "accomplishments": "I volunteered at the Manheim Township CoderDojo for about a year. During my time there, I taught kids aged eight to fourteen how to program JavaScript. This volunteer work was some of the most fun I've had volunteering, mostly thanks to how wacky and fun the group was.",
        "notes":
        [
            "Some of the main tools we used for teaching were online games like LightBot.",
            "There was a CoderDojo section for older students (like me), but we never did much since the Dojo only met one Tuesday a month.",
            "Some of my superiors at the Dojo were professionals in the Lancaster tech industry — I made sure to pick their brains for learning and work opportunities."
        ]
    }
}
